var sayings = new Array(
"追踪着鹿的猎人是看不见山的",
"有志始知蓬莱近，无为总觉咫尺远",
"志之所趋，无远勿届，穷山复海不能限也；志之所向，无坚不摧",
"雄鹰必须比鸟飞得高，因为它的猎物就是鸟",
"无所求则无所获",
"志不真则心不热，心不热则功不贤",
"志正则众邪不生",
"鹰爱高飞，鸦栖一枝",
"鸟贵有翼，人贵有志",
"器大者声必闳，志高者意必远",
"燕雀安知鸿鹄之志哉",
"三军可夺帅也，匹夫不可夺志也",
"志坚者，功名之柱也",
"登山不以艰险而止，则必臻乎峻岭",
"即使爬到最高的山上，一次也只能脚踏实地地迈一步",
"有事者，事竟成；破釜沉舟，百二秦关终归楚",
"苦心人，天不负；卧薪尝胆，三千越甲可吞吴",
"与其临渊羡鱼，不如退而结网",
"蚁穴虽小，溃之千里"
);
function csaying(){
    document.getElementById("saying").innerHTML=sayings[Math.round(Math.random() * (sayings.length - 1))];
    setTimeout("csaying()",Math.round(Math.random() * (2000) + 8000));
}
csaying();